app/controllers/students_controller.rb

  def index

    @students = if params[:movie]
      Student.where('favoritemovie LIKE?', "%#{params[:movie]}%")
    else
      @students = Student.all
---
SELECT "students".* FROM "students" WHERE (favoritemovie LIKE'%The Fly%')
SELECT "students".* FROM "students"